# GetName Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transaction..::..GetName Method
Transaction Class See Also
---
Returns the transaction's name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string GetName()
```

Visual Basic
---
```text
Public Function GetName As String
```

Visual C++
---
```text
public:
String^ GetName()
```

# ### Return Value
The transaction's current name.
# See Also
Transaction Class
Autodesk.Revit.DB Namespace